Repository: afup/web
Catalog: event/resources/languages/plugins/*-cookie-law-*.po
Languages: fr_fr

source: Custome Message
fr_fr: Message personnalisé

source: Translate
fr_fr: Traduire

source: Top Center
fr_fr: En haut centré

source: Bottom Center
fr_fr: En bas centré

source: EU Cookie Law informs users that your site uses cookies, with option to lock scripts before consent. Light + Customizable style.
fr_fr: EU Cookie Law informe les utilisateurs que votre site utilise des cookies, avec option de verrouillage scripts avant de consentement. Lumière + personnalisable style.

source: Appearance
fr_fr: Apparence

source: Save Changes
fr_fr: Enregistrer les modifications

source: days
fr_fr: jours

source: weeks
fr_fr: semaines

source: months
fr_fr: mois

source: Scroll Consent
fr_fr: Consentement par défilement

source: Share Cookie across Network
fr_fr: Partager les cookies à travers le réseau

source: Network Domain
fr_fr: Domaine du réseau

source: Bottom Right
fr_fr: En bas à droite

source: Top Right
fr_fr: En haut à droite

source: Bottom Left
fr_fr: En bas à gauche

source: Top Left
fr_fr: En haut à droite

source: Font Color
fr_fr: Couleur de la police

source: Content
fr_fr: Contenu

source: Custom URL
fr_fr: URL personnalisée

source: Blocked code message
fr_fr: Message du code bloqué

source: Accept
fr_fr: Accepter

source: Revoke cookie consent
fr_fr: Révoquer le consentement au cookie

source: Activate
fr_fr: Activé

source: This function will automatically block iframes, embeds and scripts in your post, pages and widgets.
fr_fr: Cette fonction permet de bloquer automatiquement les iframes, embeds et les scripts dans vos articles, pages et widgets.

source: Cookie acceptance length
fr_fr: Durée d&rsquo;acceptation du cookie

source: Once the user clicks accept the bar will disappear. You can set how long this will apply for before the bar reappears to the user.
fr_fr: Une fois que l'utilisateur clique sur « Accepter » la barre disparaitra. Vous pouvez définir l'intervalle de temps avant que la barre ne réapparaisse à l'utilisateur.

source: Set "0" for SESSION cookie.
fr_fr: Mettre « 0 » pour le SESSION cookie.

source: Navigation Consent
fr_fr: Consentement par navigation

source: Background Color
fr_fr: Couleur d&rsquo;arrière plan

source: Bar Message
fr_fr: Message de la barre

source: More Info Text
fr_fr: Texte du bouton « Plus d'info »

source: Accept Text
fr_fr: Texte du bouton « Accepter »

source: Bar Link
fr_fr: Lien de la barre

source: Use this field if you want to link a page instead of showing the popup
fr_fr: Utilisez ce champ si vous souhaitez lier une page au lieu d&rsquo;afficher la fenêtre contextuelle.

source: Enter the destination URL
fr_fr: Saisissez le lien de destination

source: "Close Popup" Text
fr_fr: Texte du bouton « Fermer le popup »

source: By continuing to use the site, you agree to the use of cookies.
fr_fr: En continuant à utiliser le site, vous acceptez l&rsquo;utilisation des cookies.

source: This is the message that will be displayed when cookie are not accepted
fr_fr: C'est le message qui sera affiché lorsque les cookies ne sont pas acceptés.

source: Rate us
fr_fr: Évaluez-nous

source: Close
fr_fr: Fermer

source: more information
fr_fr: Plus d&rsquo;informations

source: "Disable Cookie" Text
fr_fr: Texte « Cookie refusé »

source: Cookie disabled message
fr_fr: Message des cookies refusés.

source: Cookies are enabled
fr_fr: Les cookies sont autorisés

source: Cookies are disabled<br>Accept Cookies by clicking "%s" in the banner.
fr_fr: Les cookies ne sont pas autorisés<br>Accepter les cookies en cliquant sur « %s » dans la barre.

source: <b>Content not available.</b><br><small>Please allow cookies by clicking Accept on the banner</small>
fr_fr: <b>Contenu non disponible.</b><br><small>Merci d&rsquo;accepter les cookies en cliquant sur « Accepter » sur la bannière.</small>

source: The cookie settings on this website are set to "allow cookies" to give you the best browsing experience possible. If you continue to use this website without changing your cookie settings or you click "Accept" below then you are consenting to this.
fr_fr: Les paramètres des cookies sur ce site sont définis sur « accepter les cookies » pour vous offrir la meilleure expérience de navigation possible. Si vous continuez à utiliser ce site sans changer vos paramètres de cookies ou si vous cliquez sur "Accepter" ci-dessous, vous consentez à cela.

source: Click here if you want to consider scrolling as cookie acceptation. Users should be informed about this...
fr_fr: Cliquez ici si vous voulez considérer le défilement comme acceptation des cookies. Les utilisateurs doivent être informés à ce sujet&hellip;

source: Click here if you want to consider continuing navigation as cookie acceptation. Users should be informed about this...
fr_fr: Cliquez ici si vous voulez considérer la poursuite de la navigation comme acceptation des cookies. Les utilisateurs doivent être informés à ce sujet&hellip;

source: Click here if you want to share euCookie across your network (subdomains or multisite)
fr_fr: Cliquez ici si vous voulez partager les cookies sur votre réseau (sous-domaines pour le multisite).

source: Popup Box Content
fr_fr: Contenu de la fenêtre popup

source: Use this to add a popup that informs your users about your cookie policy
fr_fr: Utilisez cette option pour ajouter un popup d&rsquo;information pour vos utilisateurs sur votre politique d&rsquo;utilisation des cookies.

source: This is the message that will be displayed for locked-code areas
fr_fr: C'est le message qui sera affiché pour les zones de code verrouillée

source: Cookie enabled message
fr_fr: Message lorsque les cookies sont acceptés

source: This is the message that will be displayed when cookie are enabled
fr_fr: C'est le message qui sera affiché lorsque cookies sont autorisés.

source: Changelog
fr_fr: Liste des modifications

source: Auto Block
fr_fr: Blocage automatique

source: Enable TinyMCE Button
fr_fr: Activer le bouton TinyMCE

source: Click here if you want to turn on the TinyMCE button for manual insertion of EU Cookie Law shortcodes while editing contents.
fr_fr: Cliquez ici si vous souhaitez activer le bouton TinyMCE pour l’insertion manuelle du code court de EU Cookie Law, lors de l’édition des contenus.
